# ProgressDlgClose

## Description
Close the progress dialog opened with ProgressDlgOpen.

```pascal
PROCEDURE ProgressDlgClose;
```

```python
def vs.ProgressDlgClose():
    return None
```

## Examples
les can be found at [[VS:Progress Dialog]].

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYeld

## Version
Availability: from Vectorworks 2015

## Category
* Utility